In [3]:
import json
with open('sample2.json')as f:
    data=json.load(f)
    
print(data)

{'firstName': 'Joe', 'lastName': 'Jackson', 'gender': 'male', 'age': 28, 'address': {'streetAddress': '101', 'city': 'San Diego', 'state': 'CA'}, 'phoneNumbers': [{'type': 'home', 'number': '7349282382'}]}

In [33]:
import pandas as pd
dft=pd.read_csv('bank.csv')
dft.head(100)

,CustomerID,Name,Surname,Gender,Age,Region,JobClassification,DateJoined,Balance
0,100000001,Simon,Walsh,Male,21,England,White Collar,05.Jan.15,113810.15
1,400000002,Jasmine,Miller,Female,34,Northern Ireland,Blue Collar,06.Jan.15,36919.73
2,100000003,Liam,Brown,Male,46,England,White Collar,07.Jan.15,101536.83
3,300000004,Trevor,Parr,Male,32,Wales,White Collar,08.Jan.15,1421.52
4,100000005,Deirdre,Pullman,Female,38,England,Blue Collar,09.Jan.15,35639.79
...,...,...,...,...,...,...,...,...,...
95,100000096,Joshua,Slater,Male,28,England,White Collar,16.Mar.15,67479.01
96,100000097,Heather,Wallace,Female,38,England,Blue Collar,16.Mar.15,61890.85
97,100000098,Maria,Johnston,Female,36,England,White Collar,16.Mar.15,1430.60
98,200000099,Robert,May,Male,40,Scotland,Blue Collar,16.Mar.15,5456.86
99,200000100,Carolyn,Robertson,Female,56,Scotland,Other,16.Mar.15,13251.27

In [20]:
import pandas as pd  
df = pd.read_table("sample3.txt")  
print(df)

                                        Hello Welcome
0   Lorem ipsum dolor sit amet, consectetur adipis...
1   Iam id ipsum absurdum, maximum malum neglegi. ...
2                           Quis istum dolorem timet?
3   Summus dolor plures dies manere non potest? Di...
4   Ex eorum enim scriptis et institutis cum omnis...
5   Quod si ita est, sequitur id ipsum, quod te ve...
6   Quem si tenueris, non modo meum Ciceronem, sed...
7   Stulti autem malorum memoria torquentur, sapie...
8   Esse enim quam vellet iniquus iustus poterat i...
9   Quae autem natura suae primae institutionis ob...
10  Verum tamen cum de rebus grandioribus dicas, i...
11  Hoc est non modo cor non habere, sed ne palatu...
12  Voluptatem cum summum bonum diceret, primum in...
13                              Idemne, quod iucunde?
14  Haec mihi videtur delicatior, ut ita dicam, mo...

In [34]:
import pandas as pd
dft=pd.read_csv('iris.csv')
dft.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [35]:
print(dft.tail())

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [37]:
dft.columns

Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

In [38]:
dft.describe(include="all")

        sepal.length  sepal.width  petal.length  petal.width variety
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  Setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.057333      3.758000     1.199333     NaN
std         0.828066     0.435866      1.765298     0.762238     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [43]:
dft.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [45]:
dft.count()

sepal.length    150
sepal.width     150
petal.length    150
petal.width     150
variety         150
dtype: int64

In [46]:
len(dft.columns)

5

In [50]:
len(dft)

150

In [51]:
dft.shape

(150, 5)

In [55]:
print(dft['petal.length'].mean())

3.7580000000000027

In [64]:
dft[['sepal.length','sepal.width','petal.length','petal.width']].mean()

sepal.length    5.843333
sepal.width     3.057333
petal.length    3.758000
petal.width     1.199333
dtype: float64

In [72]:
import pandas as pd
import json
df=pd.read_json('sample2.json')
df.head()

,firstName,lastName,gender,age,address,phoneNumbers
0,Joe,Jackson,male,28,"{'streetAddress': '101', 'city': 'San Diego', ...","{'type': 'home', 'number': '7349282382'}"

In [73]:
dft[['sepal.length','sepal.width','petal.length','petal.width']].std()

sepal.length    0.828066
sepal.width     0.435866
petal.length    1.765298
petal.width     0.762238
dtype: float64